In [2]:
USE Chinook

--1
Select
    Name
    ,REPLACE(Name, ' & ', ' and ') AS NewName
FROM Genre
WHERE Name LIKE '%&%'

In [ ]:
USE Chinook

--2
SELECT
    CONCAT(FirstName, ' ', LastName) AS FullName
    --,FirstName
    --,LastName
    --,BirthDate
    ,DAY(BirthDate) AS Day
    ,DATENAME(month, BirthDate) AS Month
    ,YEAR(BirthDate) AS Year
FROM Employee

In [ ]:
USE Chinook

--3
SELECT
    --Title
    REPLACE(Title, ' ', '') AS TitleNoSpaces
    ,UPPER(Title) AS TitleUpperCase
    ,REVERSE(Title) AS TitleReverse
    ,LEN(Title) AS TitleLength
    ,CHARINDEX(' ', Title) AS SpaceLocation
FROM Album

In [ ]:
USE Chinook

--4
SELECT
    FirstName
    ,LastName
    ,BirthDate
    ,DATEDIFF(day, Birthdate,GETDATE())/365 AS Age
FROM Employee

In [ ]:
USE Chinook

--5
SELECT 
    Title
    ,SUBSTRING(Title, CHARINDEX(' ', Title)+1, LEN(Title)) AS ShortTitle
FROM Employee

In [ ]:
USE Chinook

--6
SELECT
    FirstName
    ,LastName
    ,CONCAT(Left(TRIM(FirstName),1), Left(TRIM(LastName), 1)) AS Initials
FROM Customer
ORDER BY Initials

In [ ]:
USE Chinook

--7
SELECT 
    CONCAT(FirstName, ' ', LastName) AS Name
    --,Phone
    ,TRIM(REPLACE(REPLACE(Phone, '+1', ''), '-', ' ')) AS Phone
    --,Fax
    --,TRIM(REPLACE(REPLACE(Fax,'+1', ''), '-', ' '))
    ,ISNULL(TRIM(REPLACE(REPLACE(Fax,'+1', ''), '-', ' ')), 'Unknown') AS Fax
FROM Customer
WHERE Country = 'USA'
ORDER BY LastName

In [ ]:
USE Chinook

--8
SELECT
    UPPER(CONCAT(LastName, ', ', FirstName)) AS CustomerName
    ,ISNULL(Company,'N/A')
FROM Customer
WHERE LastName LIKE '[A-M]%'
--ORDER BY LastName

In [ ]:
USE Chinook

--9
SELECT
    InvoiceId
    ,CustomerId
    ,Total
    ,CONVERT(varchar, InvoiceDate, 101) AS InvoiceDate
    ,CONCAT('FY', IIF(MONTH(InvoiceDate) <=6, YEAR(InvoiceDate), YEAR(InvoiceDate)+1)) AS FiscalYear
FROM Invoice
ORDER BY YEAR(InvoiceDate) DESC,MONTH(InvoiceDate) DESC, DAY(InvoiceDate) DESC

In [ ]:
USE Chinook

--10
SELECT 
    IIF(Country = 'USA' OR Country = 'Canada', 'Domestic', 'International') AS CustomerType
    ,FirstName
    ,LastName
    ,Country
FROM Customer
ORDER BY CustomerType, LastName